OpenNuvoton/M480BSP/Library/USB_Host/src_uac/uac_core.c
    //if (uac_check_fu_ctrl(uac_info, target, chn, VOLUME_CONTROL) != 0)
    //  return UAC_RET_DEV_NOT_SUPPORTED;

    bmRequestType = USB_TYPE_CLASS | USB_RECIP_INTERFACE;

    if (req & 0x80) {
        pipe = usb_rcvctrlpipe(udev, 0);
        bmRequestType |= 0x80;
    } else {
        pipe = usb_sndctrlpipe(udev, 0);
    }


    len = usb_control_msg(udev, pipe, req, bmRequestType,
                          (VOLUME_CONTROL << 8) | chn,          // wValue
                          (fu->bUnitID << 8) | (audev->ctrl_ifnum),   // wIndex
                          (uint8_t *)volume, 2, UAC_REQ_TIMEOUT);
    if (len == 2)
        return 0;
    else
        return -1;
}


/**
 *  @brief  Audio Class device automatic gain control.
 *  @param[in]  audev  UAC device
 *  @param[in]  target Select the control target.
 *                     - \ref UAC_SPEAKER
 *                     - \ref UAC_MICROPHONE
 *  @param[in]  req    Control request. This UAC driver supports the following request:
 *                     - \ref UAC_SET_CUR
 *                     - \ref UAC_GET_CUR
 *  @param[in]  chn    The requested channel. It can be one of the followings:
 *                     - \ref UAC_CH_LEFT_FRONT
 *                     - \ref UAC_CH_RIGHT_FRONT
 *                     - \ref UAC_CH_CENTER_FRONT
 *                     - \ref UAC_CH_LOW_FREQ_EN
 *                     - \ref UAC_CH_LEFT_SRN
 *                     - \ref UAC_CH_RIGHT_SRN
 *                     - \ref UAC_CH_LEFT_OF_CENTER
 *                     - \ref UAC_CH_RIGHT_OF_CENTER
 *                     - \ref UAC_CH_SURROUND
 *                     - \ref UAC_CH_SIDE_LEFT
 *                     - \ref UAC_CH_SIDE_RIGHT
 *                     - \ref UAC_CH_TOP
 *  @param[in]  mute   One byte data. If the channel's automaic gain control is on, then the value is 1. Otherwise, it's 0.
 *  @return   Success or failed.
 *  @retval   0        Success
 *  @retval   UAC_RET_DEV_NOT_SUPPORTED  This UAC device does not support this function.
 *  @retval   Otheriwse  Error occurred
 */
int  usbh_uac_auto_gain_control(UAC_DEV_T *audev, uint8_t target, uint8_t req, uint16_t chn, uint8_t *mute)
{
    struct usb_device   *udev = audev->udev;
    UAC_INFO_T  *uac_info = (UAC_INFO_T *)audev->priv;
    AC_FU_T     *fu;
    int         pipe, len;
    uint8_t     bmRequestType;

    if (uac_info == NULL)
        return UAC_RET_IO_ERR;

    if (target == UAC_SPEAKER)
        fu = uac_info->fu_play;
    else if (target == UAC_MICROPHONE)
        fu = uac_info->fu_rec;
    else
        return UAC_RET_INVALID;

    //if (uac_check_fu_ctrl(uac_info, target, chn, MUTE_CONTROL) != 0)
    //  return UAC_RET_DEV_NOT_SUPPORTED;

    bmRequestType = USB_TYPE_CLASS | USB_RECIP_INTERFACE;

    if (req & 0x80) {
        pipe = usb_rcvctrlpipe(udev, 0);
        bmRequestType |= 0x80;
    } else {
        pipe = usb_sndctrlpipe(udev, 0);
    }

    len = usb_control_msg(udev, pipe, req, bmRequestType,
                          (AUTOMATIC_GAIN_CONTROL << 8) | chn,        // wValue
                          (fu->bUnitID << 8) | (audev->ctrl_ifnum),   // wIndex
                          mute, 1, UAC_REQ_TIMEOUT);
    if (len == 1)
        return 0;
    else
        return -1;
}


/// @cond HIDDEN_SYMBOLS

static void iso_in_irq(struct urb *urb)
{
    UAC_DEV_T *audev = (UAC_DEV_T *)urb->context;
    uint8_t     *buff;
    int         i, len, cp_len;
    int         status;

    /* We don't want to do anything if we are about to be removed! */
    if (!audev || !audev->udev)
        return;

    //printf("Iso in - SF=%d, EC=%d, L=%d.\n", urb->start_frame, urb->error_count, urb->actual_length);
    //printf("IN: SF=%d, L=%d\n", urb->start_frame, urb->actual_length);

    for (i = 0; i < urb->number_of_packets; i++) {
        len = urb->iso_frame_desc[i].actual_length;
        if (!len)
            continue;

        buff = (uint8_t *)urb->transfer_buffer + i * AU_IN_MAX_PKTSZ;
        cp_len = audev->au_in_bufsz - audev->au_in_bufidx;
        if (cp_len > len)
            cp_len = len;

        memcpy(&(audev->au_in_buff[audev->au_in_bufidx]), buff, cp_len);
        audev->au_in_func(audev, &(audev->au_in_buff[audev->au_in_bufidx]), cp_len);

        audev->au_in_bufidx += cp_len;
        len -= cp_len;

        if (len) {
            buff += cp_len;
            memcpy(audev->au_in_buff, buff+cp_len, len);
            audev->au_in_func(audev, audev->au_in_buff, len);
            audev->au_in_bufidx = len;
        }
    }

    if (!audev->in_streaming)
        return;

    urb->transfer_flags = URB_ISO_ASAP;
    urb->number_of_packets = UAC_ISO_FRAME;
    urb->transfer_buffer_length = AU_IN_MAX_PKTSZ * UAC_ISO_FRAME;
    urb->actual_length = 0;
    for (i = 0; i < UAC_ISO_FRAME; i++) {
        urb->iso_frame_desc[i].status = 0;
        urb->iso_frame_desc[i].actual_length = 0;
    }

    /* Submit URB */
    status = usb_submit_urb(urb, 0);
    if (status)
        USBAS_DBGMSG("iso_in_irq: usb_submit_urb ret %d\n", status);
}

/// @endcond HIDDEN_SYMBOLS


/**
 *  @brief  Install isochronous-in (microphone) callback function. Received audio data from
 *          UAC device will be delivered to user application by this callback function.
 *  @param[in] audev      Audio Class device
 *  @param[in] au_in_buff Audio stream input buffer. User application prepares and announces
 *                        this buffer. UAC driver will directly move received audio data into
 *                        it. Once UAC driver moves audio data into au_in_buff, it will call
 *                        the callback to notify user.
 *  @param[in] bufsiz     Size of au_in_buff.
 *  @param[in] func       The audio in callback function.
 *  @return   Success or not.
 *  @retval    0          Success
 *  @retval    Otherwise  Failed
 */
int usbh_uac_install_iso_in_callback(UAC_DEV_T *audev, uint8_t *au_in_buff, int bufsiz, UAC_CB_FUNC *func)
{
    UAC_INFO_T  *uac_info = (UAC_INFO_T *)audev->priv;
    struct usb_endpoint_descriptor  *ep;

    if (!func || !uac_info)
        return UAC_RET_INVALID;

    ep = uac_info->epd_rec;
    if (!ep) {
        USBAS_DBGMSG("Isochronous-in endpoint not found in this device!\n");
        return UAC_RET_DEV_NOT_SUPPORTED;
    }

    audev->au_in_func = func;
    audev->au_in_buff = au_in_buff;
    audev->au_in_bufsz = bufsiz;
    audev->au_in_bufidx = 0;
    return UAC_RET_OK;
}


/**
 *  @brief  Start to receive audio data from UAC device via isochronous in pipe.
 *  @param[in] audev      Audio Class device
 *  @return   Success or not.
 *  @retval    0          Success
 *  @retval    Otherwise  Failed
 */
int usbh_uac_start_iso_in(UAC_DEV_T *audev)
{
    UAC_INFO_T  *uac_info = (UAC_INFO_T *)audev->priv;
    struct usb_endpoint_descriptor  *ep;
    struct urb  *urb;
    int         uidx, i, ret;

