OpenNuvoton/M480BSP/Library/USB_Host/src_uac/uac_core.c
    if (!uac_info || !audev->au_in_func || (audev->urbin[0]))
        return UAC_RET_INVALID;

    ep = uac_info->epd_rec;
    if (!ep) {
        USBAS_DBGMSG("Isochronous-in endpoint not found in this device!\n");
        return UAC_RET_DEV_NOT_SUPPORTED;
    }

    audev->au_in_bufidx = 0;

    /* Set interface alternative settings */
    if (usb_set_interface(audev->udev, uac_info->ifd_rec->bInterfaceNumber, uac_info->ifd_rec->bAlternateSetting) != 0)
        return UAC_RET_IO_ERR;

    for (uidx = 0; uidx < ISO_IN_URB_CNT; uidx++) {
        urb = usb_alloc_urb(0, GFP_KERNEL);
        if (urb == NULL) {
            USBAS_DBGMSG("Failed to allocated URB!\n");
            ret = UAC_RET_OUT_OF_MEMORY;
            goto err_out;
        }

        urb->transfer_buffer = USB_malloc(AU_IN_MAX_PKTSZ * UAC_ISO_FRAME, 4);
        if (urb->transfer_buffer == NULL) {
            USBAS_DBGMSG("Failed to allocated isochronous in buffer!\n");
            ret = UAC_RET_OUT_OF_MEMORY;
            break;
        }

        audev->urbin[uidx] = urb;
        urb->dev = audev->udev;
        urb->context = audev;
        urb->pipe = usb_rcvisocpipe(audev->udev, ep->bEndpointAddress);
        urb->transfer_flags = URB_ISO_ASAP;
        urb->complete = iso_in_irq;
        urb->interval = ep->bInterval;
        urb->number_of_packets = UAC_ISO_FRAME;
        urb->transfer_buffer_length = AU_IN_MAX_PKTSZ * UAC_ISO_FRAME;
        urb->actual_length = 0;

        for (i = 0; i < UAC_ISO_FRAME; i++) {
            urb->iso_frame_desc[i].offset = i * AU_IN_MAX_PKTSZ;
            urb->iso_frame_desc[i].length = ep->wMaxPacketSize;
        }

        ret = usb_submit_urb(urb, 0);
        if (ret) {
            USBAS_DBGMSG("Error - failed to submit URB (%d)", ret);
            ret = UAC_RET_IO_ERR;
            goto err_out;
        }

        audev->in_streaming = 1;
    }

    if (audev->in_streaming)
        return UAC_RET_OK;

err_out:
    for (i = 0; i < ISO_IN_URB_CNT; i++) {
        if (audev->urbin[i]) {
            if (audev->urbin[i]->transfer_buffer) {
                USB_free(audev->urbin[i]->transfer_buffer);
                audev->urbin[i]->transfer_buffer = NULL;
            }
            usb_unlink_urb(audev->urbin[i]);
            usb_free_urb(audev->urbin[i]);
            audev->urbin[i] = NULL;
        }
    }
    audev->in_streaming = 0;
    audev->au_in_func = NULL;
    return ret;
}


/**
 *  @brief  Stop UAC device audio in data stream.
 *  @param[in] audev      Audio Class device
 *  @return   Success or not.
 *  @retval    0          Success
 *  @retval    Otherwise  Failed
 */
int usbh_uac_stop_iso_in(UAC_DEV_T *audev)
{
    UAC_INFO_T  *uac_info = (UAC_INFO_T *)audev->priv;
    int    i;

    audev->in_streaming = 0;

    /* Set interface alternative settings */
    usb_set_interface(audev->udev, uac_info->ifd_rec->bInterfaceNumber, 0);

    for (i = 0; i < ISO_IN_URB_CNT; i++) {
        if (audev->urbin[i]) {
            usb_unlink_urb(audev->urbin[i]);
            if (audev->urbin[i]->transfer_buffer)
                USB_free(audev->urbin[i]->transfer_buffer);
            usb_free_urb(audev->urbin[i]);
            audev->urbin[i] = NULL;
        }
    }
    return UAC_RET_OK;
}


/// @cond HIDDEN_SYMBOLS

static void iso_out_irq(struct urb *urb)
{
    UAC_DEV_T *audev = (UAC_DEV_T *)urb->context;
    struct usb_endpoint_descriptor  *ep;
    int         i, status;

    /* We don't want to do anything if we are about to be removed! */
    if (!audev || !audev->udev)
        return;

    ep = ((UAC_INFO_T *)audev->priv)->epd_play;

    //printf("Iso out - SF=%d, EC=%d, L=%d.\n", urb->start_frame, urb->error_count, urb->actual_length);
    //printf("OUT: SF=%d, L=%d\n", urb->start_frame, urb->actual_length);

    if (!audev->out_streaming)
        return;

    urb->transfer_flags = URB_ISO_ASAP;
    urb->number_of_packets = UAC_ISO_FRAME;
    urb->transfer_buffer_length = AU_OUT_MAX_PKTSZ * UAC_ISO_FRAME;
    urb->actual_length = 0;
    for (i = 0; i < UAC_ISO_FRAME; i++) {
        urb->iso_frame_desc[i].status = 0;
        urb->iso_frame_desc[i].offset = i * AU_OUT_MAX_PKTSZ;
        urb->iso_frame_desc[i].actual_length = audev->au_out_func(audev, (uint8_t *)urb->transfer_buffer + urb->iso_frame_desc[i].offset, ep->wMaxPacketSize);
        urb->iso_frame_desc[i].length = urb->iso_frame_desc[i].actual_length;
        urb->actual_length += urb->iso_frame_desc[i].actual_length;
    }

    /* Submit URB */
    status = usb_submit_urb(urb, 0);
    if (status)
        USBAS_DBGMSG("iso_out_irq: usb_submit_urb ret %d\n", status);
}

/// @endcond HIDDEN_SYMBOLS


/**
 *  @brief  Install isochronous-out (speaker) callback function. The UAC driver will call
 *          the callback function to request one audio out packet from user application.
 *          UAC driver will then send this packet to UAC device via isochronous out pipe.
 *  @param[in] audev      Audio Class device
 *  @param[in] func       The audio out callback function.
 *  @return   Success or not.
 *  @retval    0          Success
 *  @retval    Otherwise  Failed
 */
int usbh_uac_install_iso_out_callback(UAC_DEV_T *audev, UAC_CB_FUNC *func)
{
    UAC_INFO_T  *uac_info = (UAC_INFO_T *)audev->priv;
    struct usb_endpoint_descriptor  *ep;

    if (!func || !uac_info)
        return UAC_RET_INVALID;

    ep = uac_info->epd_play;
    if (!ep) {
        USBAS_DBGMSG("Isochronous-out endpoint not found in this device!\n");
        return UAC_RET_DEV_NOT_SUPPORTED;
    }

    audev->au_out_func = func;
    return UAC_RET_OK;
}


/**
 *  @brief  Start to send audio data to UAC device via isochronous out pipe.
 *  @param[in] audev      Audio Class device
 *  @return   Success or not.
 *  @retval    0          Success
 *  @retval    Otherwise  Failed
 */
int usbh_uac_start_iso_out(UAC_DEV_T *audev)
{
    UAC_INFO_T  *uac_info = (UAC_INFO_T *)audev->priv;
    struct usb_endpoint_descriptor  *ep;
    struct urb  *urb;
    int         uidx, i, ret = 0;

    if (!uac_info || !audev->au_out_func || (audev->urbout[0]))
        return UAC_RET_INVALID;

    ep = uac_info->epd_play;
    if (!ep) {
        USBAS_DBGMSG("Isochronous-out endpoint not found in this device!\n");
        return UAC_RET_DEV_NOT_SUPPORTED;
    }

