OpenNuvoton/M480BSP/Library/USB_Host/src_uac/uac_core.c
    /* Set interface alternative settings */
    if (usb_set_interface(audev->udev, uac_info->ifd_play->bInterfaceNumber, uac_info->ifd_play->bAlternateSetting) != 0)
        return UAC_RET_IO_ERR;

    for (uidx = 0; uidx < ISO_OUT_URB_CNT; uidx++) {
        urb = usb_alloc_urb(0, GFP_KERNEL);
        if (urb == NULL) {
            USBAS_DBGMSG("Failed to allocated URB!\n");
            ret = UAC_RET_OUT_OF_MEMORY;
            goto err_out;
        }

        urb->transfer_buffer = USB_malloc(AU_IN_MAX_PKTSZ * UAC_ISO_FRAME, 4);
        if (urb->transfer_buffer == NULL) {
            USBAS_DBGMSG("Failed to allocated isochronous in buffer!\n");
            ret = UAC_RET_OUT_OF_MEMORY;
            break;
        }

        audev->urbout[uidx] = urb;
        urb->dev = audev->udev;
        urb->context = audev;
        urb->pipe = usb_sndisocpipe(audev->udev, ep->bEndpointAddress);
        urb->transfer_flags = URB_ISO_ASAP;
        urb->complete = iso_out_irq;
        urb->interval = ep->bInterval;
        urb->number_of_packets = UAC_ISO_FRAME;
        urb->transfer_buffer_length = AU_OUT_MAX_PKTSZ * UAC_ISO_FRAME;
        urb->actual_length = 0;

        for (i = 0; i < UAC_ISO_FRAME; i++) {
            urb->iso_frame_desc[i].offset = i * AU_OUT_MAX_PKTSZ;
            urb->iso_frame_desc[i].length = audev->au_out_func(audev, (uint8_t *)urb->transfer_buffer + urb->iso_frame_desc[i].offset, ep->wMaxPacketSize);
            if (urb->iso_frame_desc[i].length > ep->wMaxPacketSize) {
                USBAS_ERRMSG("Audio-out packet buffer overrun!\n");
                goto err_out;
            }
            urb->iso_frame_desc[i].actual_length = urb->iso_frame_desc[i].length;
        }

        ret = usb_submit_urb(urb, 0);
        if (ret) {
            USBAS_DBGMSG("Error - failed to submit URB (%d)", ret);
            ret = UAC_RET_IO_ERR;
            goto err_out;
        }
        audev->out_streaming = 1;
    }

    return UAC_RET_OK;

err_out:
    for (i = 0; i < ISO_OUT_URB_CNT; i++) {
        if (audev->urbout[i]) {
            usb_unlink_urb(audev->urbout[i]);
            if (audev->urbout[i]->transfer_buffer)
                USB_free(audev->urbout[i]->transfer_buffer);
            usb_free_urb(audev->urbout[i]);
        }
    }
    audev->out_streaming = 0;
    audev->au_out_func = NULL;
    return ret;
}


/**
 *  @brief  Stop UAC device audio out data stream.
 *  @param[in] audev      Audio Class device
 *  @return   Success or not.
 *  @retval    0          Success
 *  @retval    Otherwise  Failed
 */
int usbh_uac_stop_iso_out(UAC_DEV_T *audev)
{
    UAC_INFO_T  *uac_info = (UAC_INFO_T *)audev->priv;
    int    i;

    audev->out_streaming = 0;

    /* Set interface alternative settings */
    usb_set_interface(audev->udev, uac_info->ifd_play->bInterfaceNumber, 0);

    for (i = 0; i < ISO_OUT_URB_CNT; i++) {
        if (audev->urbout[i]) {
            usb_unlink_urb(audev->urbout[i]);
            if (audev->urbout[i]->transfer_buffer)
                USB_free(audev->urbout[i]->transfer_buffer);
            usb_free_urb(audev->urbout[i]);
            audev->urbout[i] = NULL;
        }
    }
    return UAC_RET_OK;
}


/*@}*/ /* end of group M480_USBH_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group M480_USBH_Library */

/*@}*/ /* end of group M480_Library */

/*** (C) COPYRIGHT 2016 Nuvoton Technology Corp. ***/

